<HTML>
<HEAD>
 <TITLE>¡FAQs (Preguntas y Respuestas) de Astroseries y Más!</TITLE>
</HEAD>
<BODY TEXT="#000000" BGCOLOR="#FFFFFF" LINK="#000080" ALINK="#0000FF" VLINK="800080">


<H1>Astroseries</H1>
<BR>
<B>(Tambi&eacute;n conocido como Astroseries RTS)</B><BR>
<BR>
<H3>Preguntas Frecuentes (FAQs)</H3><BR>

<B>NOTA:</B> Aseg&uacute;rese de visitar 
<A HREF="http://www.astroseries.com" TARGET="_blank">el sitio web de Astroseries</A> si est&aacute; buscando m&aacute;s informaci&oacute;n.  Podr&aacute; utilizar los foros all&iacute; presentes para hacer preguntas o leer lo que los otros han dicho/dicen.<BR>



<BR>
<A HREF="#Q0">-¿C&oacute;mo instalar/desinstalar el juego?</A><BR>
<A HREF="#Q0A">-¿Qu&eacute; es Astroseries?</A><BR>
<A HREF="#Q1">-¿C&oacute;mo inicio Astroseries?</A><BR>
<A HREF="#Q2">-El juego no corre. ¿Qu&eacute; hacer?</A><BR>
<A HREF="#Q3">--- Estaba jugando una campaña y guardé un juego. Cuando regres&eacute; y trat&eacute; de cargarlo, el juego hizo "crash" (se sali&oacute;). ¿Qu&eacute; hacer? ---</A><BR>
<A HREF="#Q4"><B>-¿Puedo saltar niveles en una campaña?</B></A><BR>

<A HREF="#Q4P1">-El juego se comporta de manera extraña</A><BR>

<A HREF="#Q4A">-Cuando ataco defensas planetarias, mis unidades atacan al planeta y NO a las defensas planetarias.  ¿Qu&eacute; hacer?</A><BR>
<A HREF="#Q4B">-Cuando uso el editor de mapas (Map Editor) ¿C&oacute;mo borro unidades?</A><BR>
<A HREF="#Q5">-¿Qu&eacute; es FreeCraft?</A><BR>
<A HREF="#Q6">-¿Qu&eacute; es Stratagus?</A><BR>
<A HREF="#Q6A">-¿Cu&aacute;ndo ser&aacute; Astroseries importado en Stratagus?</A><BR>
<A HREF="#Q6B">-¿D&oacute;nde puedo obtener m&aacute;s ayuda, noticias, etc?</A><BR>
<A HREF="#Q7">-¿C&oacute;mo puedo llegar al sitio web de Astroseries?</A><BR>
<A HREF="#Q8">-Noticias Legales</A><BR>

<BR>
<BR>
<BR>

<HR>
<BR>
<A NAME="Q0"></A><B>How to Install / Uninstall the game?</B><BR>
<BR>

<B>Astroseries - C&oacute;mo Instalar</B><BR>

<BR>
1) Copie la carpeta "Astroseries" a su disco duro.
S&oacute;lo arrastre la carpeta a donde usted la quiera en su disco duro y espere a que el copiado concluya. (Este es el m&eacute;todo de instalaci&oacute;n si se est&aacute; instalando desde un CD)<BR>
<BR>
2) Una vez en su disco duro, corra stratagus.exe para empezar el juego.<BR>
<BR>
<BR>




<B>Para Desinstalar</B><BR>
<BR>
S&oacute;lo borre la carpeta "Astroseries" envi&aacute;ndola a la papelera de reciclaje.  Una vez la papelera de reciclaje haya sido vaciada, el juego estar&aacute; completamente desinstalado de su equipo.<BR>

<BR>
<HR>
<BR>



<BR>
<A NAME="Q0A"></A><B>¿Qu&eacute; es Astroseries?</B><BR>
<BR>

Astroseries, o Astroseries RTS, como muchas veces se le conoce, es un juego de Estrategia en Tiempo Real ubicado en una era futur&iacute;stica, mostrando un conflicto entre m&uacute;ltiples naciones interestelares.<BR>



<BR>
<BR>
<A NAME="Q1"></A><B>¿C&oacute;mo inicio Astroseries?</B><BR>
<BR>
Presione dos veces (haga doble click) en el &iacute;cono de stratagus.exe (o el &iacute;cono correspondiente si en Linux u otro sistema operativo) presente en este mismo directorio/carpeta.<BR>

<BR>
<BR>

<A NAME="Q2"></A><B>El juego no corre. ¿Qu&eacute; hacer?</B><BR>
<BR>
En algunas computadoras, el juego toma m&aacute;s tiempo en cargar, Espere un poco.  Sin embargo, si sospecha que el juego no va a correr, intente reinstalando el juego.<BR>
<BR>
<BR>

<A NAME="Q3"></A><B>--- Estaba jugando una campaña y guardé un juego. Cuando regres&eacute; y trat&eacute; de cargarlo, el juego hizo "crash" (se sali&oacute;). ¿Qu&eacute; hacer? ---</B><BR>
<BR>
Por favor lea la pr&oacute;xima pregunta.  Le da a usted la oportunidad de saltar niveles en una campaña.  Es la mejor soluci&oacute;n que se le ha encontrado a este problema hasta el momento.  Se espera poder resolver este problema en alg&uacute;n tiempo.<BR>
<BR> 
<BR>

<A NAME="Q4"></A><B>¿Puedo saltar niveles en una campaña?</B><BR>


&nbsp;&nbsp;¡Si, se puede!  Aunque en nombre de la diversi&oacute;n se recomienda jugar todos los niveles, pueden haber situaciones en las que desee saltar niveles.  Puede querer saltar un nivel si:<BR>

<UL>
 <LI>Est&aacute; atrapado en un nivel y no puede avanzar (por alguna raz&oacute;n).<BR>
 <LI>Guard&oacute; un juego pero cuando trata de cargarlo, el juego se sale ("crash").<BR>
</UL>
<BR>

Esta versi&oacute;n de Astroseries incluye juegos pre-guardados.  Puede querer cargar alguno de los juegos pre-guardados de human01.sav.gz hasta human16.sav.gz para la Imperial Union, o nagoran01.sav.gz hasta human16.sav.gz para el Nagoran Empire.  Si hay alg&uacute;n problema, o prefiere un m&eacute;todo alternativo, siga leyendo.<BR>
<BR>

Aparte del descrito anteriormente, hay otros dos m&eacute;todos para saltar niveles.<BR>

<BR>
<B>M&eacute;todo 1</B><BR>
<BR>


1) Durante el juego, presione la tecla ENTER (para poder escribir un mensaje)<BR>
<BR>
2) Escriba (todo en min&uacute;sculas) lo siguiente:  <B>unite the clans</B><BR>
<BR>
3) Presione la tecla ENTER de nuevo.<BR>
<BR>
El nivel actual deber&iacute;a terminar, en victoria para usted.  Proceder&aacute; hacia el pr&oacute;ximo nivel en la campaña. Si usted est&aacute; haciendo esto porque un juego guardado no carga, repita tantas veces como sea necesario para llegar a donde estaba :-)<BR>

<BR>
<BR>


<B>M&eacute;todo 2</B><BR>
<BR>
&nbsp;&nbsp;Hay una forma de correr niveles individuales.  Para jugar cualquier nivel en cualquier momento, siga estos pasos:<BR>
<BR>

1) Corra stratagus.exe (o archivo correspondiente si se encuentra en Linux u otro sistema operativo)<BR>
2) Desde el menu, escoja "Single Player Game".<BR>
3) Aparecen un grupo de opciones.  Presione (click) en "Select Scenario".  Un di&aacute;logo aparece.
4) Em "Type", seleccione Stratagus scenario (cm).<BR>
5) Luego justo debajo de "Map size", hay una carpeta con una flecha hacia arriba que dice "maps" al lado.  Presione (click) all&iacute.<BR>
6) Presione (click) en campaigns.<BR>
7) Ahora tiene dos opciones: human o nagoran.  &nbsp;&nbsp;Presione (click) en la que usted desee.  NOTA: human es la Imperial Union.<BR>
8) Una lista de mapas aparece, desde level01h.cm hasta level16h.cm  (o level01n.cm hasta level16n.cm, si escogi&oacute; nagoran)<BR>
9) Suponga que quiere jugar el nivel 9 de human, entonces presione en level09h.cm<BR>
10) El di&aacute;logo se cierra.  El mapa est&aacute; listo.  Ahora presione (click) en "Start Game".<BR>
11) ¡Divi&eacute;rtase!<BR>
<BR>


<BR>
<BR>






<A NAME="Q4P1"></A><B>El juego se comporta de manera extraña</B><BR>
<BR>
  Si el juego se comporta de modo extraño, como que antes hab&iacute;a sonido, y de pronto no suena m&aacute;s, o los cursores del rat&oacute;n no son los que deber&iacute;an ser, o alg&uacute;n otro comportamiento err&aacute;tico, lo que debe hacer es guardar "Save" el juego en curso, salir del programa, y correrlo de nuevo.  Si al guardar el juego el teclado no responde (algunas veces sucede), escoja default.sav.gz con el rat&oacute;n y guarde all&iacute;. (para eso est&aacute; este archivo).  La pr&oacute;xima vez que arranque el juego, todos esos extraños s&iacute;ntomas ya no deber&iacute;an estar.<BR>


<BR>
<BR>
<BR>




<A NAME="Q4A"></A><B>Cuando ataco defensas planetarias, mis unidades atacan al planeta y NO a las defensas planetarias.  ¿Qu&eacute; hacer?</B><BR>
<BR>
  Si sus unidades atacan al planeta en vez de las defensas planetarias, haga que se detengan (presionand en su boton STOP) para que ellos detengan el ataque.  Ellos agarrar&aacute; y atacar&aacute;n el objetivo correcto de manera autom&aacute;tica.<BR>
<BR>
<BR>

<A NAME="Q4B"></A><B>Cuando uso el editor de mapas (Map Editor) ¿C&oacute;mo borro unidades?</B><BR>
<BR>
Mueva el cursor del rat&oacute;n (mouse) sobre la unidad que quiere remover.  Luego presione la tecla DELETE (o DEL, o SUPRIMIR) en su teclado.<BR>
<BR>
<BR>

<A NAME="Q5"></A><B>¿Qu&eacute; es FreeCraft?</B><BR>
<BR>
FreeCraft ha sido pr&aacute;cticamente reemplazado por su bastante mejorado sucesor, Stratagus.  Lea la pr&oacute;xima pregunta/respuesta para m&aacute;s informaci&oacute;n.<BR>
<BR>
<BR>

<A NAME="Q6"></A><B>¿Qu&eacute; es Stratagus?</B><BR>
<BR>
Stratagus es un motor de videojuegos que permite crear sus propios Juegos de Estrategia en Tiempo Real (RTS), similares a WarCraft I / WarCraft II, StarCraft, Red Alert, Ages of Empires, etc. Para m&aacute;s informaci&oacute;n sobre Stratagus, visite:<BR>
<BR>
<A HREF="http://www.stratagus.org" TARGET="_blank">-Stratagus.Org</A><BR>
<BR>
O busque la palabra "Stratagus" en su motor de b&uacute;queda favorito.<BR>
<BR>
<BR>



<A NAME="Q6A"></A><B>¿Cu&aacute;ndo ser&aacute; Astroseries importado en Stratagus?</B><BR>
<BR>
&nbsp;&nbsp;Astroseries fue importado en Stratagus el 3 de octubre de 2004.  Desde entonces el juego ha sufrido una serie de mejoras en el tiempo.  El Astroseries presente aqu&iacute; est&aacute; en Stratagus.<BR>
<BR>
<BR>


<A NAME="Q6B"></A><B>¿D&oacute;nde puedo obtener m&aacute;s ayuda, noticias, etc?</B><BR>
<BR>

Visite el siguiente sitio web: <A HREF="http://www.astroseries.com" TARGET="_blank">Astroseries.Com</A> 
  All&iacute; encontrar&aacute; informaci&oacute;n actualizada, ayudas, noticias, actualizaciones, parches, foros, otros juegos Astroseries y en general todo tipo de informaci&oacute;n y contenido relacionado a Astroseries.<BR>
<BR>
<BR>



<A NAME="Q7"></A><B>¿C&oacute;mo puedo llegar al sitio web de Astroseries?</B><BR>
<BR>

<A HREF="http://www.astroseries.com" TARGET="_blank">http://www.astroseries.com</A><BR>
<BR>
<BR>



<A NAME="Q8"></A><B>Noticias Legales</B><BR>
<BR>

&nbsp;&nbsp;Utilice este videojuego/software a su propio riesgo.  NO somos responsables por cualquier daño que pueda surgir o suceder a su computadora/ordenador/equipo como resultado de utilizar o malutilizar es videojuego / software.  Este videojuego / software NO tiene ning&uacute;n virus hasta el mejor de nuestro conocimiento, sin embargo, ya que es "freeware", las personas pueden pasar este videojuego / software de computadora a computadora, y como resultado, si usted tiene un software anti-virus, deber&iacute;a comprobar si los archivos est&aacute;n limpios antes de correr el videojuego / software.  Los videojuegos Astroseries y HREF="http://www.astroseries.com" TARGET="_blank">Astroseries.Com</A> son Copyright de Alvaro Francisco Perez Baneres.  FreeCraft / Stratagus son Copyright de sus respectivos creadores, y la mejor forma de contactarlos o de utilizar su software es visitar su sitio web en <A HREF="http://www.stratagus.org" TARGET="_blank">Stratagus.Org</A> o buscar la palabra "Stratagus" en su motor de b&uacute;squeda favorito.  Todos los otros trademarks son propiedad de sus respectivos propietarios.<BR>

<BR>
<BR>
<BR>
<BR>
<BR>

<I>Astroseries V1.3 lanzado en Febrero 23, 2005</I><BR>
<BR>
<I>Este documento actualizado por &uacute;ltima vez en Febrero 23, 2005</I><BR>


<BR>
<BR>
<BR>
<BR>
<BR>
<BR>
<HR>
<BR>
<BR>

<DIV ALIGN="CENTER"><CENTER>
¿Buscando videojuegos? Encu&eacute;ntrelos en 
<A HREF="http://www.altamega.net" TARGET="_blank">http://www.altamega.net</A><BR>
</CENTER></DIV>
<BR>



<BR>
<BR>
<BR>
<BR>
<BR>


 </BODY>
</HTML>


